# Python не має вбудованої підтримки для масивів, але замість них
# можна викоритстовувати списки Python
# На цій сторінці показано, як використовувати списки, як масиви. Однак
# для роботи з масивами в Python вам доведеться імпортувати бібліотеку,
# як-от бібліотеку NumPy.
# Масив використовується для зберігання кількох значень в одній змінній
cars = ["Ford", "Volvo", "BMW"]
x = cars[0]
print(x)
cars[0] = "Toyota"
print(cars)
# щоб повернути довжину масиву (провірити кількість елементів)
# використовуйте метод len()
x = len(cars)
print(x)
# довжина масиву завжди на одиницю більша за найвищий індекс масиву
for x in cars:
    print(x)
# ви можете додати елемент масиву
cars.append("Honda")
print(cars)
# ви можете прибрати елемент масиву
cars.pop(3)
print(cars)
cars.remove("Volvo")
print(cars)