# лямбда функція - це невелика анонімна функція
# лямбда функція може приймати будь-яку кількість
# аргументів, але може мати лише один вираз
x = lambda a: a + 10
print(x(5))
x1 = lambda a, b: a * b
print(x1(5,10))
x2 = lambda a, b, c: a + b + c
print(x2(10, 5, 6))
# потужність лямбда функції краще видно, коли ви використовуєте її як
# анонімну функцію всередині іншої функції.
# Скажімо, у вас є визначення функції, яка приймає один аргумент і цей
# аргумент буде помножено на невідоме число:
def myfunc(n):
    return lambda a : a * n
# використовуйте це визначення функції, щоб створити функцію, яка завжди
# подвоює число, яке ви надсилаєте
mydoubler = myfunc(2)
print(mydoubler(10))
# або скористайтесь тим самим визначенням, щоб створити функцію, яка
# зажди потроює число
mytripler = myfunc(3)
print(mytripler(11))
