# за допомогою циклу while ми можемо виконувати набір оператороів,
# якщо умова виконується.
i = 1
while i < 6:
    print(i)
    i += 1
# цикл while вимагає, щоб відповідні змінні були готові
i = 1
# за допомогою оператора break ми можемо зупинити цикл, навіть якщо умова
# whil виконується
while i < 6:
    print(i)
    if i == 3:
        break
    i += 1
# за допомогою оператора continue ми можемо зупинити поточну ітерацію ти продовжити наступну
i = 0
while i < 6:
    i += 1
    if i == 3:
        continue
    print(i)
# за допомогою оператора else ми можемо запустити блок коду один раз,
# коли умова більше не виконується
i = 0
while i < 6:
    print(i)
    i += 1
else:
    print("i is no longer less than 6")